app/controllers/estabelecimentos_controller.rb

SELECT * FROM "estabelecimentos"
---
  def index
    @estabelecimentos = Estabelecimento.all

SELECT * FROM "estabelecimentos" WHERE ("estabelecimentos"."id" = 1)
---
  def show
    @estabelecimento = Estabelecimento.find(params[:id])

SELECT * FROM "estabelecimentos" WHERE ("estabelecimentos"."id" = 1)
---
  def edit
    @estabelecimento = Estabelecimento.find(params[:id])

INSERT INTO "estabelecimentos" ("created_at", "end_numero", "cidade_id", "nome", "bairro_id", "cep", "updated_at", "end_complemento", "end_logradouro") VALUES('2011-04-06 15:00:15.205999', '12', 1, 'Supermercado Familia', 1, '60120020', '2011-04-06 15:00:15.205999', '', 'Av. Woshington Soares') RETURNING "id"
---
  def create
    @estabelecimento = Estabelecimento.new(params[:estabelecimento])

    respond_to do |format|
      if @estabelecimento.save